app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "date", "description") VALUES('2010-01-16 21:00:34', 'Tuser1', '2010-01-16 21:00:34', '2010-01-16 21:00:00', 'foijeorijfoejrofje')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "updated_at" = '2010-01-16 21:00:55', "description" = 'ewfefwe fwefwef wefwefwef' WHERE "id" = 2

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1